hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/driver/src/hc32f120_timerb.c
    /* Configures the registers to reset value. */
    WRITE_REG(TMRBx->CNTER, 0x0000);
    WRITE_REG(TMRBx->PERAR, 0xFFFF);
    WRITE_REG(TMRBx->BCSTR, 0x0002);

    return Ok;
}

/**
 * @brief  Set TimerB count direction.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 *           @arg M0P_TMRB5:            TimerB unit 5 instance register base
 *           @arg M0P_TMRB6:            TimerB unit 6 instance register base
 *           @arg M0P_TMRB7:            TimerB unit 7 instance register base
 *           @arg M0P_TMRB8:            TimerB unit 8 instance register base
 * @param  [in] u16Direction            TimerB count direction
 *         This parameter can be one of the following values:
 *           @arg TIMERB_CNT_UP:        TimerB count up
 *           @arg TIMERB_CNT_DOWN:      TimerB count down
 * @retval None
 */
void TIMERB_SetCntDirection(M0P_TMRB_TypeDef *TMRBx, uint16_t u16Direction)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_CNT_DIRECTION(u16Direction));

    MODIFY_REG(TMRBx->BCSTR, TMRB_BCSTR_DIR, u16Direction);
}

/**
 * @brief  Get TimerB count direction.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 *           @arg M0P_TMRB5:            TimerB unit 5 instance register base
 *           @arg M0P_TMRB6:            TimerB unit 6 instance register base
 *           @arg M0P_TMRB7:            TimerB unit 7 instance register base
 *           @arg M0P_TMRB8:            TimerB unit 8 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg TIMERB_CNT_UP:        TimerB count up
 *           @arg TIMERB_CNT_DOWN:      TimerB count down
 */
uint16_t TIMERB_GetCntDirection(M0P_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

    return READ_BIT(TMRBx->BCSTR, TMRB_BCSTR_DIR);
}

/**
 * @brief  Set TimerB count mode.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 *           @arg M0P_TMRB5:            TimerB unit 5 instance register base
 *           @arg M0P_TMRB6:            TimerB unit 6 instance register base
 *           @arg M0P_TMRB7:            TimerB unit 7 instance register base
 *           @arg M0P_TMRB8:            TimerB unit 8 instance register base
 * @param  [in] u16Mode                 TimerB count mode
 *         This parameter can be one of the following values:
 *           @arg TIMERB_TRIANGLE_WAVE: TimerB triangle wave mode
 *           @arg TIMERB_SAWTOOTH_WAVE: TimerB sawtooth wave mode
 * @retval None
 */
void TIMERB_SetCntMode(M0P_TMRB_TypeDef *TMRBx, uint16_t u16Mode)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_CNT_MODE(u16Mode));

    MODIFY_REG(TMRBx->BCSTR, TMRB_BCSTR_MODE, u16Mode);
}

/**
 * @brief  Get TimerB count mode.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 *           @arg M0P_TMRB5:            TimerB unit 5 instance register base
 *           @arg M0P_TMRB6:            TimerB unit 6 instance register base
 *           @arg M0P_TMRB7:            TimerB unit 7 instance register base
 *           @arg M0P_TMRB8:            TimerB unit 8 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg TIMERB_TRIANGLE_WAVE: TimerB triangle wave mode
 *           @arg TIMERB_SAWTOOTH_WAVE: TimerB sawtooth wave mode
 */
uint16_t TIMERB_GetCntMode(M0P_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

    return READ_BIT(TMRBx->BCSTR, TMRB_BCSTR_MODE);
}

/**
 * @brief  Set TimerB clock division.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 *           @arg M0P_TMRB5:            TimerB unit 5 instance register base
 *           @arg M0P_TMRB6:            TimerB unit 6 instance register base
 *           @arg M0P_TMRB7:            TimerB unit 7 instance register base
 *           @arg M0P_TMRB8:            TimerB unit 8 instance register base
 * @param  [in] u16Div                  TimerB clock division
 *         This parameter can be one of the following values:
 *           @arg TIMERB_CLKDIV_DIV1:   HCLK
 *           @arg TIMERB_CLKDIV_DIV2:   HCLK/2
 *           @arg TIMERB_CLKDIV_DIV4:   HCLK/4
 *           @arg TIMERB_CLKDIV_DIV8:   HCLK/8
 *           @arg TIMERB_CLKDIV_DIV16:  HCLK/16
 *           @arg TIMERB_CLKDIV_DIV32:  HCLK/32
 *           @arg TIMERB_CLKDIV_DIV64:  HCLK/64
 *           @arg TIMERB_CLKDIV_DIV128: HCLK/128
 *           @arg TIMERB_CLKDIV_DIV256: HCLK/256
 *           @arg TIMERB_CLKDIV_DIV512: HCLK/512
 *           @arg TIMERB_CLKDIV_DIV1024:HCLK/1024
 * @retval None
 */
void TIMERB_SetClkDiv(M0P_TMRB_TypeDef *TMRBx, uint16_t u16Div)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_CLOCK_DIV(u16Div));

    MODIFY_REG(TMRBx->BCSTR, TMRB_BCSTR_CKDIV, u16Div);
}

/**
 * @brief  Get TimerB clock division.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 *           @arg M0P_TMRB5:            TimerB unit 5 instance register base
 *           @arg M0P_TMRB6:            TimerB unit 6 instance register base
 *           @arg M0P_TMRB7:            TimerB unit 7 instance register base
 *           @arg M0P_TMRB8:            TimerB unit 8 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg TIMERB_CLKDIV_DIV1:   HCLK
 *           @arg TIMERB_CLKDIV_DIV2:   HCLK/2
 *           @arg TIMERB_CLKDIV_DIV4:   HCLK/4
 *           @arg TIMERB_CLKDIV_DIV8:   HCLK/8
 *           @arg TIMERB_CLKDIV_DIV16:  HCLK/16
 *           @arg TIMERB_CLKDIV_DIV32:  HCLK/32
 *           @arg TIMERB_CLKDIV_DIV64:  HCLK/64
 *           @arg TIMERB_CLKDIV_DIV128: HCLK/128
 *           @arg TIMERB_CLKDIV_DIV256: HCLK/256
 *           @arg TIMERB_CLKDIV_DIV512: HCLK/512
 *           @arg TIMERB_CLKDIV_DIV1024:HCLK/1024
 */
uint16_t TIMERB_GetClkDiv(M0P_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

    return READ_BIT(TMRBx->BCSTR, TMRB_BCSTR_CKDIV);
}

/**
 * @brief  Get TimerB flag status.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 *           @arg M0P_TMRB5:            TimerB unit 5 instance register base
 *           @arg M0P_TMRB6:            TimerB unit 6 instance register base
 *           @arg M0P_TMRB7:            TimerB unit 7 instance register base
 *           @arg M0P_TMRB8:            TimerB unit 8 instance register base
 * @param  [in] u16Flag                 TimerB flag type
 *         This parameter can be one of the following values:
 *           @arg TIMERB_FLAG_OVF:      Overflow flag
 *           @arg TIMERB_FLAG_UDF:      Underflow flag
 *           @arg TIMERB_FLAG_CMP:      Compare match flag
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t TIMERB_GetFlag(M0P_TMRB_TypeDef *TMRBx, uint16_t u16Flag)
{
    en_flag_status_t enFlag = Reset;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_FLAG(u16Flag));

    switch (u16Flag)
    {
        case TIMERB_FLAG_OVF:
        case TIMERB_FLAG_UDF:
            enFlag = (READ_BIT(TMRBx->BCSTR, u16Flag)) ? Set : Reset;
            break;
        case TIMERB_FLAG_CMP:
            enFlag = (READ_BIT(TMRBx->STFLR, u16Flag)) ? Set : Reset;
        default:
            break;
    }

