hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/driver/src/hc32f120_timerb.c
    return READ_BIT(TMRBx->HCUPR, TMRB_HCUPR_HCUP);
}

/**
 * @brief  Set TimerB hardware down counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 *           @arg M0P_TMRB5:            TimerB unit 5 instance register base
 *           @arg M0P_TMRB6:            TimerB unit 6 instance register base
 *           @arg M0P_TMRB7:            TimerB unit 7 instance register base
 *           @arg M0P_TMRB8:            TimerB unit 8 instance register base
 * @param  [in] u16Condition            TimerB hardware down counter condition
 *         This parameter can be any composed value of the following values:
 *           @arg TIMERB_HWDOWN_INVALID:             Hardware count down is invalid
 *           @arg TIMERB_HWDOWN_TIMB_T_PWM1_RISING:  Hardware count down by rising edge on timer input TIMB_<t>_PWM1, t = 1~8
 *           @arg TIMERB_HWDOWN_TIMB_T_PWM1_FALLING: Hardware count down by falling edge on timer input TIMB_<t>_PWM1, t = 1~8
 *           @arg TIMERB_HWDOWN_EVT:                 Hardware count down by the timer TMRB_HTSSR specified event
 *           @arg TIMERB_HWDOWN_OVERFLOW:            Hardware count down by overflow by TIMB_<n>, _<n>_=2/4/6/8 when m=1/3/5/7 or n=1/3/5/7 when m=2/4/6/8
 *           @arg TIMERB_HWDOWN_UNDERFLOW:           Hardware count down by underflow by TIMB_<n>, _<n>_=2/4/6/8 when m=1/3/5/7 or n=1/3/5/7 when m=2/4/6/8
 * @retval  None
 */
void TIMERB_SetHwDownCondition(M0P_TMRB_TypeDef *TMRBx,
                                        uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_IC_HCUP_CONDITION(u16Condition));

    MODIFY_REG(TMRBx->HCDOR, TMRB_HCDOR_HCDO, u16Condition);
}

/**
 * @brief  Get TimerB hardware down counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 *           @arg M0P_TMRB5:            TimerB unit 5 instance register base
 *           @arg M0P_TMRB6:            TimerB unit 6 instance register base
 *           @arg M0P_TMRB7:            TimerB unit 7 instance register base
 *           @arg M0P_TMRB8:            TimerB unit 8 instance register base
 * @retval Returned value can be any composed value of the following values:
 *           @arg TIMERB_HWDOWN_INVALID:             Hardware count down is invalid
 *           @arg TIMERB_HWDOWN_TIMB_T_PWM1_RISING:  Hardware count down by rising edge on timer input TIMB_<t>_PWM1, t = 1~8
 *           @arg TIMERB_HWDOWN_TIMB_T_PWM1_FALLING: Hardware count down by falling edge on timer input TIMB_<t>_PWM1, t = 1~8
 *           @arg TIMERB_HWDOWN_EVT:                 Hardware count down by the timer TMRB_HTSSR specified event
 *           @arg TIMERB_HWDOWN_OVERFLOW:            Hardware count down by overflow by TIMB_<n>, _<n>_=2/4/6/8 when m=1/3/5/7 or n=1/3/5/7 when m=2/4/6/8
 *           @arg TIMERB_HWDOWN_UNDERFLOW:           Hardware count down by underflow by TIMB_<n>, _<n>_=2/4/6/8 when m=1/3/5/7 or n=1/3/5/7 when m=2/4/6/8
 */
uint16_t TIMERB_GetHwDownCondition(M0P_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

    return READ_BIT(TMRBx->HCDOR, TMRB_HCDOR_HCDO);
}

/**
 * @brief  Initialize TimerB input capture function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 *           @arg M0P_TMRB5:            TimerB unit 5 instance register base
 *           @arg M0P_TMRB6:            TimerB unit 6 instance register base
 *           @arg M0P_TMRB7:            TimerB unit 7 instance register base
 *           @arg M0P_TMRB8:            TimerB unit 8 instance register base
 * @param  [in] pstcIcInit              Pointer to a @ref stc_timerb_ic_init_t structure (TMRBx unit input capture function configuration data structure).
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: TMRBx is invalid instance or pstcIcInit == NULL
 */
en_result_t TIMERB_IC_Init(M0P_TMRB_TypeDef *TMRBx,
                                const stc_timerb_ic_init_t *pstcIcInit)
{
    /* Check TMRBx instance and pstcIcInit */
    if ((!IS_TIMERB_INSTANCE(TMRBx)) || (NULL == pstcIcInit))
    {
        return ErrorInvalidParameter;
    }

    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_IC_CAPTURE_CONDITION(pstcIcInit->u16CaptureCondition));
    DDL_ASSERT(IS_TIMERB_IC_NOISE_FILTER_CLKDIV(pstcIcInit->u16NoiseFilterClkDiv));

    MODIFY_REG(TMRBx->CCONR,                                                   \
               (TMRB_CCONR_CAPMDA   | TMRB_CCONR_HICP |                        \
                TMRB_CCONR_NOFIENCP | TMRB_CCONR_NOFICKCP),                    \
               (TIMERB_INPUT_CAPTURE            |                              \
                pstcIcInit->u16CaptureCondition |                              \
                pstcIcInit->u16NoiseFilterClkDiv));

    return Ok;
}

/**
 * @brief  Set the fields of structure stc_timerb_ic_init_t to default values.
 * @param  [out] pstcIcInit             Pointer to a @ref stc_timerb_ic_init_t structure (TMRBx unit input capture function configuration data structure).
 * @retval None
 */
en_result_t TIMERB_IC_StructInit(stc_timerb_ic_init_t *pstcIcInit)
{
    /* Check parameters */
    if (NULL == pstcIcInit)
    {
        return ErrorInvalidParameter;
    }

    pstcIcInit->u16NoiseFilterClkDiv = TIMERB_IC_NOFICLKDIV_NONE;
    pstcIcInit->u16CaptureCondition = TIMERB_IC_INVALID;

    return Ok;
}

/**
 * @brief  De-Initialize TimerB unit input capture.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 *           @arg M0P_TMRB5:            TimerB unit 5 instance register base
 *           @arg M0P_TMRB6:            TimerB unit 6 instance register base
 *           @arg M0P_TMRB7:            TimerB unit 7 instance register base
 *           @arg M0P_TMRB8:            TimerB unit 8 instance register base
 * @retval An en_result_t enumeration value:
 *           - Ok: De-Initialize success
 *           - ErrorInvalidParameter: TMRBx is invalid instance
 */
en_result_t TIMERB_IC_DeInit(M0P_TMRB_TypeDef *TMRBx)
{
    /* Check TMRBx instance */
    if (!IS_TIMERB_INSTANCE(TMRBx))
    {
        return ErrorInvalidParameter;
    }

