hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/driver/src/hc32f120_timerb.c
    return READ_BIT(TMRBx->PCONR, TMRB_PCONR_PERC);
}

/**
 * @brief  Set TIMB_<t>_PWM1 port output polarity for force.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 *           @arg M0P_TMRB5:            TimerB unit 5 instance register base
 *           @arg M0P_TMRB6:            TimerB unit 6 instance register base
 *           @arg M0P_TMRB7:            TimerB unit 7 instance register base
 *           @arg M0P_TMRB8:            TimerB unit 8 instance register base
 * @param  [in] u16Polarity             TimerB TIMB_<t>_PWM1 port output polarity
 *         This parameter can be one of the following values:
 *           @arg TIMERB_OC_FORCE_OUTPUT_LOW        Force TIM_<t>_PWM1 output low level
 *           @arg TIMERB_OC_FORCE_OUTPUT_HIGH       Force TIM_<t>_PWM1 output high level
 *           @arg TIMERB_OC_FORCE_OUTPUT_INVALID    Force invalid
 * @retval None
 */
void TIMERB_OC_SetForceOutputPolarity(M0P_TMRB_TypeDef *TMRBx,
                                                uint16_t u16Polarity)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_OC_FORCE_OUTPUT_POLARITY(u16Polarity));

    MODIFY_REG(TMRBx->PCONR, TMRB_PCONR_FORC, u16Polarity);
}

/**
 * @brief  Get TIMB_<t>_PWM1 port output polarity for force.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 *           @arg M0P_TMRB5:            TimerB unit 5 instance register base
 *           @arg M0P_TMRB6:            TimerB unit 6 instance register base
 *           @arg M0P_TMRB7:            TimerB unit 7 instance register base
 *           @arg M0P_TMRB8:            TimerB unit 8 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg TIMERB_OC_FORCE_OUTPUT_LOW        Force TIM_<t>_PWM1 output low level
 *           @arg TIMERB_OC_FORCE_OUTPUT_HIGH       Force TIM_<t>_PWM1 output high level
 *           @arg TIMERB_OC_FORCE_OUTPUT_INVALID    Force invalid
 */
uint16_t TIMERB_OC_GetForceOutputPolarity(M0P_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

    return READ_BIT(TMRBx->PCONR, TMRB_PCONR_FORC);
}

/**
 * @}
 */

#endif /* DDL_TIMERB_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
